tutorials/heatTransfer/directChillFoam/Pb18wtSn/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           volScalarField;
    location        "0";
    object          T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

tInitial        558.638;//660;

waterTemp       298.0;

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform $tInitial;

boundaryField
{
    "(bottom|top)"
    {
        type            zeroGradient;
    }

    right
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;
        Ta              constant $waterTemp;
        h               uniform 400.0;
        value           $internalField;
    }

    left
    {
        type            symmetryPlane;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
