tutorials/heatTransfer/directChillFoam/Pb18wtSn/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           volVectorField;
    location        "0";
    object          U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    ".*"
    {
        type            fixedValue;
        value           $internalField;
    }

    left
    {
        type            symmetryPlane;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
