tutorials/heatTransfer/directChillFoam/Pb18wtSn/constant/soluteProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          soluteProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

C_SOLMAX    0.192;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solutes
(
    Sn
    {
        D_l   1e-9;
        kp    0.3102;
        C0    0.18;
        Ceut  0.619;
        beta  0.49;
        interpolate no;
      //C_l.Sn table ((<alpha_l> <C_l>));
    }
);


// ************************************************************************* //
