tutorials/heatTransfer/directChillFoam/Pb18wtSn/constant/tStar
(
    (-9999 469.00)
    (0 469.00)
    (0.01011 491.85)
    (0.02188 496.98)
    (0.03245 501.31)
    (0.04298 505.12)
    (0.05429 508.57)
    (0.06528 511.74)
    (0.07561 514.69)
    (0.0899 517.47)
    (0.10247 520.09)
    (0.1185 522.58)
    (0.13989 524.96)
    (0.15345 527.25)
    (0.1696 529.45)
    (0.18914 531.57)
    (0.20258 533.62)
    (0.21997 535.61)
    (0.24044 537.54)
    (0.26483 539.42)
    (0.29432 541.25)
    (0.33058 543.03)
    (0.37602 544.78)
    (0.4342 546.48)
    (0.51019 548.15)
    (0.6103 549.78)
    (0.73751 551.38)
    (0.87752 552.95)
    (0.99846 554.49)
    (1 556.00)
    (9999 556.00)
)
