tutorials/heatTransfer/directChillFoam/Pb18wtSn/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       tabulated;
    thermo          hIcoTabulated;
    equationOfState icoTabulated;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       26.9815;
    }

    equationOfState
    {
        R               3000;
        rho
        {
            // type                table;
            // format              foam;
                // file                "constant/rho";
            // outOfBounds         clamp;
            // interpolationScheme linear;
            values
            (
                (  1.0000    9250)
                (  9999.0    9250)
            );
        }
    }

    thermodynamics
    {
        Hf              0;
        Sf              0;
        Cp
        {
            values
            (
                (  1.0000    176)
                (  9999.0    176)
            );
        }
    }

    transport
    {
        mu
        {
            values
            (
                (  1.0000    1.1e-3)
                (  9999.0    1.1e-3)
            );
        }
        kappa
        {
            values
            (
                (  1.0000    17.9)
                (  9999.0    17.9)
            );
        }
    }
}


// ************************************************************************* //
