tutorials/heatTransfer/directChillFoam/Pb18wtSn/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

g_env           [ 0 0 0 0 0 0 0 ] 0.7;      // Coherency fraction
rho1            [ 1 -3 0 0 0 0 0 ] 9250;    // Solid density
rho2            [ 1 -3 0 0 0 0 0 ] 9250;    // Liquid density
mu1             [ 1 -1 -1 0 0 0 0 ] 1.1e-3; // Not required, but implementation requires a non-zero value
mu2             [ 1 -1 -1 0 0 0 0 ] 1.1e-3; // Dynamic viscosity (of liquid)
DAS             [ 0 1 0 0 0 0 0 ] 0.185e-3; // Dendrite arm spacing


// ************************************************************************* //
