tutorials/heatTransfer/directChillFoam/Pb18wtSn/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

DebugSwitches
{
    // mushyZoneSource 1;
    // limitSolute     1;
}

application     directChillFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         600;

deltaT          0.005;

writeControl    adjustableRunTime;

writeInterval   5;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxAlphaCo      0.5;

numericalFunctions
{
    #includeFunc    residuals(funcName=residuals, p_rgh, U, h)
}

fieldsFunctions
{
    #includeFunc    grad(funcName=gradT, T)
}

graphFunctions
{
    #includeFunc    graphCell(
        funcName=y50mm,
        start=(0 0.05  0.5e-3),
        end=(0.05 0.05 0.5e-3),
        fields=(C.Sn),
        axis=x
    )
}

functions
{
    $numericalFunctions ;
    $fieldsFunctions ;
    $graphFunctions ;
}

OptimisationSwitches
{
  //fileHandler     collated;
}

libs (
    "libmyFvModels.so"
    "libmyFvConstraints.so"
    "libmythermophysicalTransportModels.so"
);


// ************************************************************************* //
