tutorials/heatTransfer/directChillFoam/Pb18wtSn/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitT
{
    type            limitTemperature;
    active          yes;
    selectionMode   all;
    min             293.15;
    max             873.8;
}

limitC.Sn
{
    type            limitSolute;
    active          yes;
    selectionMode   all;
    solute          C.Sn;
    min             0.0;
    max             1.0;
}


// ************************************************************************* //
